In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.0.3-cp39-cp39-win_amd64.whl (10.8 MB)
Collecting numpy>=1.20.3; python_version < "3.10"
  Downloading numpy-1.25.2-cp39-cp39-win_amd64.whl (15.6 MB)
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\임형준\appdata\roaming\python\python39\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\임형준\appdata\roaming\python\python39\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: numpy, tzdata, pytz, pandas
Successfully installed numpy-1.25.2 pandas-2.0.3 pytz-2023.3 tzdata-2023.3
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.3; however, version 23.2.1 is available.
You should consider upgrading via the 'c:\Users\임형준\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [54]:
pip install jinja2

Collecting jinja2
  Downloading Jinja2-3.1.2-py3-none-any.whl (133 kB)
Collecting MarkupSafe>=2.0
  Downloading MarkupSafe-2.1.3-cp39-cp39-win_amd64.whl (17 kB)
Installing collected packages: MarkupSafe, jinja2
Successfully installed MarkupSafe-2.1.3 jinja2-3.1.2
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.3; however, version 23.2.1 is available.
You should consider upgrading via the 'c:\Users\임형준\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [47]:
import pandas as pd

In [48]:
df = pd.read_csv('my_data.csv')
print(df)

   Unnamed: 0     name  age  salary
0           0    Alice   25   50000
1           1      Bob   30   60000
2           2  Charlie   35   70000
3           3    james   30  400000
4           4    Alice   25   50000
5           5      Bob   30   60000
6           6  Charlie   35   70000
7           7    james   30  400000

In [49]:
df.columns

Index(['Unnamed: 0', 'name', 'age', 'salary'], dtype='object')

In [50]:
df.rename(columns={'Unnamed: 0':'dr'},inplace="ture")

In [51]:
df

   dr     name  age  salary
0   0    Alice   25   50000
1   1      Bob   30   60000
2   2  Charlie   35   70000
3   3    james   30  400000
4   4    Alice   25   50000
5   5      Bob   30   60000
6   6  Charlie   35   70000
7   7    james   30  400000

In [52]:
df.drop(['dr'],axis=1,inplace=True)

In [37]:
df

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    james   30  400000
4    Alice   25   50000
5      Bob   30   60000
6  Charlie   35   70000
7    james   30  400000

In [61]:
df.set_index("name",inplace=True)

In [68]:
df

AttributeError: 'Styler' object has no attribute 'hide_index'